pH = {
    "картофель" : (4.5, 6.5),
    "кукуруза" : (5.8, 6.8),
    "рожь" : (5.5, 7.5),
    "лён" : (5.9, 6.5),
    "подсолнечник" : (6, 6.8),
    "свекла" : (6, 6.8),
    "капуста" : (6.7, 7.4)
}

SOIL = { 
    "подзолистые" : {"картофель" : False,
    "кукуруза" : True,
    "рожь" : True,
    "лён" : True,
    "подсолнечник" : False,
    "свекла" : False,
    "капуста" : True} ,

    "серые лесные" : {"картофель" : False,
    "кукуруза" : True,
    "рожь" : True,
    "лён" : False,
    "подсолнечник" : False,
    "свекла" : False,
    "капуста" : True} ,

    "каштановые" :  {"картофель" : False,
    "кукуруза" : True,
    "рожь" : True,
    "лён" : True,
    "подсолнечник" : False,
    "свекла" : False,
    "капуста" : True} ,

     "чернозем" : {"картофель" : True,
    "кукуруза" : True,
    "рожь" : False,
    "лён" : True,
    "подсолнечник" : False,
    "свекла" : True,
    "капуста" : True} ,

     "глинистые" : {"картофель" : False,
    "кукуруза" : True,
    "рожь" : True,
    "лён" : False,
    "подсолнечник" : True,
    "свекла" : False,
    "капуста" : False} ,

     "супесчаные" : {"картофель" : False,
    "кукуруза" : True,
    "рожь" : False,
    "лён" : True,
    "подсолнечник" : True,
    "свекла" : True,
    "капуста" : False} ,

     "суглинистые" : {"картофель" : True,
    "кукуруза" : False,
    "рожь" : False,
    "лён" : False,
    "подсолнечник" : True,
    "свекла" : True,
    "капуста" : True} 
}

PRED = {
    "картофель" : ["рожь", "свекла", "капуста"],
    "кукуруза" : ["картофель", "лён", "подсолнечник", "капуста"],
    "рожь" : ["кукуруза", "лён", "подсолнечник", "свекла", "капуста"],
    "лён" : ["картофель","подсолнечник","свекла"],
    "подсолнечник" : ["картофель","кукуруза","лён","свекла","капуста"],
    "свекла" : ["картофель", "рожь", "лён", "капуста"],
    "капуста" : ["картофель", "кукуруза", "подсолнечник", "свекла"]
}

if __name__ == "__main__":
    main()